# Getting Started with pandas

- Primary library of interest
- High-level data structures and manipulation tools designed to make data analysis fast and easy in Python
- Built on top of <code>NumPy</code> and makes it easy to use in <code>NumPy</code>-centric applications
    * Data structures with labeled axes supporting automatic or explicit data alignment
    * Integrated time series functionality
    * The same data structures handle both time series data and non-time series data.
    * Arithmetic operations and reductions would pass on the metadata
    * Flexible handling of missing data
    * Merge and other relational operations found in popular database databases

In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

*pandas Data Structures* >
## Introduction to <code>pandas</code> Data Structures

*pandas Data Structures* >
### <code>Series</code>

A <code>Series</code> is a one-dimensional array-like object containing an <code>array</code> of data and an associated <code>array</code> of data labels, called its *<code>index</code>*.

In [2]:
obj = Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

Get the <code>array</code> representation and <code>index</code> object of the <code>Series</code> via its <code>values</code> and <code>index</code> attributes, respectively

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

Often it will be desirable to create a <code>Series</code> with an index identifying each data point.

In [6]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a','c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 6

In [11]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

<code>NumPy array</code> operations will preserve the <code>index</code>-<code>value</code> link:

In [12]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [14]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Another way to think about a <code>Series</code> is as a fixed-length, ordered dict.

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

Should we have data contained in a Python <code>dict</code>, you can create a <code>Series</code> from it by passing the <code>dict<?code>:

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
obj3 = Series(sdata)

In [20]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

When only passing a <code>dict</code>, the <code>index</code> in the resulting <code>Series</code> will have the <code>dict</code>’s keys in sorted order.

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [22]:
obj4 = Series(sdata, index=states)

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

The **<code>isnull</code>** and **<code>notnull</code>** functions in pandas should be used to detect missing data:

In [24]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

Automatically aligns differently indexed data in arithmetic operations:

In [27]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [28]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [29]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Both the <code>Series</code> object itself and its <code>index</code> have a name attribute.

In [31]:
obj4.name = 'population'

In [30]:
obj4.index.name = 'state'

In [32]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

A <code>Series</code>’s <code>index</code> can be altered in place by assignment:

In [33]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [35]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [36]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

*pandas Data Structures* >
### <code>DataFrame</code>
A <code>DataFrame</code> represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different <code>value</code> type.

One of the most common is from a <code>dict</code> of equal-length <code>lists</code> or <code>NumPy arrays</code>.

In [37]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [38]:
frame = DataFrame(data)

<code>Index</code> assigned automatically as with </code>Series</code>, and the columns are placed in sorted order:

In [39]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

Can specify a sequence of columns.

In [40]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

If we pass a column that isn’t contained in data, it will appear with <code>NA</code> values in the result:

In [41]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                   index=['one', 'two', 'three', 'four', 'five'])

In [42]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

A column in a <code>DataFrame</code> can be retrieved as a <code>Series</code>.

In [44]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [45]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

Rows can also be retrieved by position or name by a couple of methods, such as the *<code>ix</code>* indexing field.

In [46]:
frame2.ix['three']

/Users/yoonjoonlee/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Columns can be modified by assignment.

In [48]:
frame2['debt'] = 16.5

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [50]:
frame2['debt'] = np.arange(5.)

In [51]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [47]:
frame2.ix['three']['pop']

3.6000000000000001

In [52]:
frame2.ix['three'].pop

<bound method NDFrame.pop of year     2002
state    Ohio
pop       3.6
debt        2
Name: three, dtype: object>

In [53]:
frame2['pop']['three']

3.6000000000000001

In [54]:
frame2['three']['pop']

KeyError: 'three'

When assigning <code>lists</code> or <code>arrays</code> to a column, the value’s length must match the length of the <code>DataFrame</code>.

In [55]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [56]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [57]:
frame2['debt'] = val

In [58]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

Assigning a column that doesn’t exist will create a new column.

In [59]:
frame2['eastern'] = (frame2.state == 'Ohio')

In [60]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

Another common form of data is a nested <code>dict</code> of <code>dicts</code> format:

In [61]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [62]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

Outer <code>dict</code> <code>keys</code> as the columns and the inner <code>keys</code> as the row indices:

In [63]:
frame3 = DataFrame(pop)

In [64]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [65]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

The <code>keys</code> in the inner <code>dicts</code> are unioned and sorted to form the index in the result.

In [66]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [67]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [68]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}

In [69]:
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [70]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

![](Pics/picture_3_1.png)

<code>DataFrame</code>’s index and columns have their name attributes set.

In [71]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [72]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

The values attribute.

In [73]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

The <code>DataFrame</code>’s columns are different dtypes.

In [74]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [75]:
frame2.values

array([[2000, 'Ohio', 1.5, nan, True],
       [2001, 'Ohio', 1.7, -1.2, True],
       [2002, 'Ohio', 3.6, nan, True],
       [2001, 'Nevada', 2.4, -1.5, False],
       [2002, 'Nevada', 2.9, -1.7, False]], dtype=object)

*pandas Data Structures* >
### Index Objects

<code>pandas</code>’s Index objects are responsible for holding the <code>axis</code> labels and other metadata.

In [76]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [77]:
index = obj.index

In [78]:
index

Index(['a', 'b', 'c'], dtype='object')

In [79]:
index[1:]

Index(['b', 'c'], dtype='object')

Index objects are immutable and thus can’t be modified by the user.

In [80]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [81]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [82]:
obj2.index is index

True

In [ ]:
obj2

![](Pics/picture_3_2.png)

In [83]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [84]:
'Ohio' in frame3.columns

True

In [85]:
2003 in frame3.index

False

*Essential Functionality* >
## Essential Functionality

*Essential Functionality* >
### Reindexing

**<code>reindex</code>**, which means to create a new object with the data conformed to a new index

In [86]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [87]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [88]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [89]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [90]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

Some interpolation or filling of values when reindexing: 
The moedthod option **<code>ffill</code>** allows us to forward fills the values.

In [91]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [92]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [93]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

![](Pics/picture_3_3.png)

**<code>reindex</code>** can alter either the (row) index, columns, or both.

In [94]:
frame = DataFrame(np.arange(9).reshape((3, 3)), 
                  index=['a', 'c', 'd'], 
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [95]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [96]:
states = ['Texas', 'Utah', 'California']

In [97]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Both can be reindexed in one shot, though interpolation will only apply row-wise.

In [98]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', columns=states)

ValueError: index must be monotonic increasing or decreasing

reindexing can be done more succinctly by label-indexing with <code>ix</code>:

In [99]:
frame.ix[['a', 'b', 'c', 'd'], states]

/Users/yoonjoonlee/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

![](Pics/picture_3_4.png)

*Essential Functionality* >
### Dropping entries from an axis

In [100]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [101]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
dtype: float64

In [102]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
dtype: float64

In [103]:
data = DataFrame(np.arange(16).reshape((4, 4)), 
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [104]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [105]:
data.drop('two')

ValueError: labels ['two'] not contained in axis

In [106]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [107]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

*Essential Functionality* >
### Indexing, selection, and filtering

Series indexing (<code>obj[...]</code>) works analogously to <code>NumPy array</code> indexing, except you can use the <code>Series</code>’s index values instead of only integers.

In [108]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [109]:
obj['b']

1.0

In [110]:
obj[1]

1.0

In [ ]:
obj[2:4]

In [111]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [112]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [113]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

Slicing with labels behaves differently than normal Python slicing in that the endpoint is inclusive:

In [114]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

Indexing into a <code>DataFrame</code> is for retrieving one or more columns either with a single value or sequence:

In [115]:
data = DataFrame(np.arange(16).reshape((4, 4)), 
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [116]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [117]:
data.two

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [118]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

Selecting rows by slicing or a Boolean array:

In [119]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [ ]:
data[data['three'] > 5]

Another use case is in indexing with a boolean <code>DataFrame</code>.

In [123]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [129]:
data[data < 5] = 0

In [127]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

special indexing field **<code>ix</code>**

In [139]:
data.ix[['two', 'three'], 'Colorado' ]

KeyError: 'Colorado'

In [138]:
data.ix['Colorado'][['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [140]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [141]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [142]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [143]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

![](Pics/picture_3_5.png)

*Essential Functionality* >
### Arithmetic and data alignment

One of the most important <code>pandas</code> features is the behavior of arithmetic between objects.

In [144]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [145]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [146]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal data alignment introduces <code>NA</code> values in the indices that don’t overlap.

In [147]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), 
                index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [148]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), 
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [149]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

*Essential Functionality* > *Arithmetic and data alignment* >
#### Arithmetic methods with <code>fill</code> values

In arithmetic operations between differently-indexed objects, you might want to fill with a special value, like 0, when an <code>axis</code> label is found in one object but not the other:

In [150]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [151]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [152]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

Using the add method on <code>df1</code>, I pass <code>df2</code> and an argument to **<code>fill_value</code>**:

In [153]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Relatedly, when reindexing a <code>Series</code> or <code>DataFrame</code>, you can also specify a different fill value:

In [154]:
df1.reindex(columns=df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

![](Pics/picture_3_6.png)

*Essential Functionality* > *Arithmetic and data alignment* >
#### Operations between <code>DataFrame</code> and <code>Series</code>

Arithmetic between <code>DataFrame</code> and <code>Series</code> is well-defined. Consider the difference between a 2D array and one of its rows:

In [155]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), 
                  columns=list('bde'), 
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [160]:
series = frame.ix[0]

In [156]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [161]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [162]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [163]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [164]:
series2

b    0
e    1
f    2
dtype: int64

In [165]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [166]:
series3 = frame['d']

In [167]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [168]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

*Essential Functionality* >
### Function application and mapping

<code>NumPy ufuncs</code> (element-wise array methods) work fine with <code>pandas</code> objects:

In [169]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), 
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.215643 -0.366421 -0.795421
Ohio    0.183255  0.728108  0.594896
Texas   2.842452 -0.885703  0.501528
Oregon  0.061886  1.490215  0.297905

In [170]:
np.abs(frame)

               b         d         e
Utah    0.215643  0.366421  0.795421
Ohio    0.183255  0.728108  0.594896
Texas   2.842452  0.885703  0.501528
Oregon  0.061886  1.490215  0.297905

In [171]:
frame.abs()

               b         d         e
Utah    0.215643  0.366421  0.795421
Ohio    0.183255  0.728108  0.594896
Texas   2.842452  0.885703  0.501528
Oregon  0.061886  1.490215  0.297905

Another frequent operation is applying a function on 1D arrays to each column or row.

In [172]:
frame

               b         d         e
Utah   -0.215643 -0.366421 -0.795421
Ohio    0.183255  0.728108  0.594896
Texas   2.842452 -0.885703  0.501528
Oregon  0.061886  1.490215  0.297905

In [173]:
f = lambda x: x.max() - x.min()

In [175]:
frame.apply(f)

b    3.058095
d    2.375918
e    1.390317
dtype: float64

In [176]:
frame.apply(f, axis=1)

Utah      0.579778
Ohio      0.544853
Texas     3.728155
Oregon    1.428329
dtype: float64

The function passed to **<code>apply</code>** need not return a scalar value, it can also return a <code>Series</code> with multiple values:

In [177]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [178]:
frame.apply(f)

            b         d         e
min -0.215643 -0.885703 -0.795421
max  2.842452  1.490215  0.594896

Element-wise Python functions can be used.

In [179]:
format = lambda x: ('%.2f') %x

In [180]:
frame.applymap(format)

            b      d      e
Utah    -0.22  -0.37  -0.80
Ohio     0.18   0.73   0.59
Texas    2.84  -0.89   0.50
Oregon   0.06   1.49   0.30

In [181]:
frame.apply(format)

TypeError: ("cannot convert the series to <class 'float'>", 'occurred at index b')

The reason for the name **<code>applymap</code>** is that <code>Series</code> has a **<code>map</code>** method for applying an element-wise function:

In [182]:
frame['e'].map(format)

Utah      -0.80
Ohio       0.59
Texas      0.50
Oregon     0.30
Name: e, dtype: object

In [183]:
frame.map(format)

AttributeError: 'DataFrame' object has no attribute 'map'

*Essential Functionality* >
### Sorting and ranking

Sorting a data set by some criterion is another important built-in operation. To sort lexicographically by row or column index, use the **<code>sort_index</code>** method, which returns a new, sorted object:

In [184]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [185]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [186]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

With a <code>DataFrame</code>, you can sort by index on either axis:

In [187]:
frame = DataFrame(np.arange(8).reshape((2, 4)), 
                  index=['three', 'one'], 
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [188]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [189]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [190]:
frame.sort_values()

TypeError: sort_values() missing 1 required positional argument: 'by'

The data is sorted in ascending order by default.

In [191]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a <code>Series</code> by its values, use its order method:

In [192]:
obj = Series([4, 7, -3, -2])

In [193]:
obj.order()

AttributeError: 'Series' object has no attribute 'order'

In [194]:
obj.sort_values()

2   -3
3   -2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the <code>Series</code> by default:

In [195]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [196]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

Sort by the values in one or more columns

In [197]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [198]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

Sort by multiple columns, pass a list of names:

In [199]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

*Ranking* is closely related to sorting, assigning ranks from one through the number of valid data points in an array. The **<code>rank</code>** methods for <code>Series</code> and <code>DataFrame</code> are the place to look; by default rank breaks ties by assigning each group the mean <code>rank</code>:

In [200]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [201]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

<code>Ranks</code> can also be assigned according to the order they’re observed in the data:

In [202]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

<code>rank</code> in descending order

In [203]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

![](Pics/picture_3_7.png)

<code>DataFrame</code> can compute ranks over the rows or the columns:

In [204]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [205]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [206]:
frame.rank()

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

*Essential Functionality* >
### <code>Axis indexes</code> with duplicate values

We have had unique <code>axis</code> labels (index values). While many <code>pandas</code> functions (like **<code>reindex</code>**) require that the labels be unique, it’s not mandatory.

In [207]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [208]:
obj.index.is_unique

False

In [209]:
obj['a']

a    0
a    1
dtype: int64

In [210]:
obj['c']

4

The same logic extends to indexing rows in a <code>DataFrame</code>:

In [211]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.816744  0.646144  0.135081
a  1.290091  0.113939  0.880533
b  0.007132  0.294061  0.495785
b -0.235073  0.719455 -1.059490

In [213]:
df.loc['b']

          0         1         2
b  0.007132  0.294061  0.495785
b -0.235073  0.719455 -1.059490

*Summarizing and Computing Descriptive Statistics* >
## Summarizing and Computing Descriptive Statistics

<code>pandas</code> objects are equipped with a set of common mathematical and statistical methods. Most of these fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a <code>Series</code> or a <code>Series</code> of values from the rows or columns of a <code>DataFrame</code>.

In [2]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Calling <code>DataFrame</code>’s <code>sum</code> method returns a <code>Series</code> containing column sums:

In [3]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [4]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [5]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

<code>NA</code> values are excluded unless the entire slice (row or column in this case) is <code>NA</code>.

In [6]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

![](Pics/picture_3_8.png)

Some methods, like <code>idxmin</code> and <code>idxmax</code>, return indirect statistics like the index value where the minimum or maximum values are attained:

In [7]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [8]:
df.idxmax()

one    b
two    d
dtype: object

In [9]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Another type of method is neither a reduction nor an accumulation. describe is one such example, producing multiple summary statistics in one shot:

In [10]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [11]:
obj = Series(['a', 'a', 'b', 'c']*4)

In [12]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

![](Pics/picture_3_9.png)

*Summarizing and Computing Descriptive Statistics* >
### Correlation and Covariance

Some summary statistics, like correlation and covariance, are computed from pairs of arguments.

The "STOXX Europe 600 (all regions)" historical daily data can be obtained at [the site](http://www.stoxx.com/download/historical_values/hbrbcpe.txt) under Benchmark Indices of the Historical Data category of the website.

In [13]:
import os.path
# os.path.isfile("stoxxeu600.txt")

In [14]:
with open("stoxxeu600.txt", 'r') as opened_file:
    for i in range(5):
        print(opened_file.readline())

Price Indices - EURO Currency

Date    ;Blue-Chip;Blue-Chip;Broad    ; Broad   ;Ex UK    ;Ex Euro Zone;Blue-Chip; Broad

        ;  Europe ;Euro-Zone;Europe   ;Euro-Zone;         ;            ; Nordic  ; Nordic

        ;  SX5P   ;  SX5E   ;SXXP     ;SXXE     ; SXXF    ;    SXXA    ;    DK5F ; DKXF

31.12.1986;775.00 ;  900.82 ;   82.76 ;   98.58 ;   98.06 ;   69.06 ;  645.26  ;  65.56

In [15]:
columns = ['Date', 'SX5P', 'SX5E', 'SXXP', 'SXXE', 
           'SXXF', 'SXXA', 'DK5F', 'DKXF', 'EMPTY']
stoxxeu600 = pd.read_csv("stoxxeu600.txt", 
                         index_col=0, 
                         parse_dates=True, 
                         dayfirst=True, 
                         header=None, 
                         skiprows=4, 
                         names=columns, 
                         sep=';')

In [16]:
del stoxxeu600['EMPTY']

In [17]:
stoxxeu600.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 7673 entries, 1986-12-31 to 2016-10-04
Data columns (total 8 columns):
SX5P    7673 non-null float64
SX5E    7673 non-null float64
SXXP    7673 non-null float64
SXXE    7673 non-null float64
SXXF    7673 non-null float64
SXXA    7673 non-null float64
DK5F    7673 non-null float64
DKXF    7673 non-null float64
dtypes: float64(8)
memory usage: 539.5 KB

In [18]:
stoxxeu600

               SX5P     SX5E    SXXP    SXXE    SXXF    SXXA     DK5F    DKXF
Date
1986-12-31   775.00   900.82   82.76   98.58   98.06   69.06   645.26   65.56
1987-01-01   775.00   900.82   82.76   98.58   98.06   69.06   645.26   65.56
1987-01-02   770.89   891.78   82.57   97.80   97.43   69.37   647.62   65.81
1987-01-05   771.89   898.33   82.82   98.60   98.19   69.16   649.94   65.82
1987-01-06   775.92   902.32   83.28   99.19   98.83   69.50   652.49   66.06
1987-01-07   781.21   899.15   83.78   98.96   98.62   70.59   651.97   66.20
1987-01-08   777.62   887.37   83.52   97.87   97.68   71.01   645.57   65.62
1987-01-09   769.80   868.31   83.03   96.31   96.22   71.40   638.03   65.14
1987-01-12   775.07   879.41   83.64   97.54   97.18   71.50   634.14   65.03
1987-01-13   770.00   872.74   83.00   96.78   96.38   70.97   622.44   63.87
1987-01-14   772.04   876.39   82.99   97.14   96.59   70.66   603.63   62.46
1987-01-15   779.12   884.37   83.77   98.10   97.60   71.28   620.01   63.89
1987-01-16   781.66   883.78   84.15   98.11   97.66   71.95   623.77   64.65
1987-01-19   773.43   876.15   83.39   97.33   96.92   71.22   630.57   65.25
1987-01-20   773.49   875.10   83.50   97.14   96.83   71.58   637.63   65.77
1987-01-21   771.09   872.47   83.35   97.02   96.74   71.40   639.38   66.06
1987-01-22   773.40   876.69   83.48   97.44   96.95   71.30   627.45   65.02
1987-01-23   778.26   883.62   84.12   98.28   97.67   71.76   628.49   64.95
1987-01-26   769.38   870.96   83.38   97.02   96.55   71.45   624.56   64.70
1987-01-27   772.16   868.19   83.64   96.77   96.25   72.12   614.25   63.67
1987-01-28   751.63   838.60   81.87   93.93   93.51   71.24   604.13   62.86
1987-01-29   757.13   847.38   82.31   94.83   94.46   71.31   613.07   63.66
1987-01-30   766.56   859.08   83.20   96.03   95.56   71.94   626.05   64.72
1987-02-02   763.91   849.03   83.03   95.14   94.80   72.36   631.84   65.20
1987-02-03   756.58   839.60   82.31   94.05   93.84   71.94   645.09   66.30
1987-02-04   762.34   838.53   82.72   93.88   93.64   72.82   643.82   66.30
1987-02-05   763.60   833.03   82.89   93.21   92.99   73.67   650.12   66.83
1987-02-06   775.28   842.23   83.87   93.98   93.68   74.80   645.00   66.36
1987-02-09   776.67   844.73   84.03   94.38   94.05   74.77   634.36   65.30
1987-02-10   764.71   837.91   82.91   93.67   93.27   73.33   631.17   64.96
...             ...      ...     ...     ...     ...     ...      ...     ...
2016-08-24  2867.74  3008.59  344.93  325.52  409.52  353.79  9191.15  586.88
2016-08-25  2845.44  2987.69  342.02  323.29  406.47  350.31  9125.15  583.05
2016-08-26  2860.49  3010.36  343.72  325.41  408.70  351.55  9174.97  585.92
2016-08-29  2857.39  2998.50  343.20  324.27  407.78  351.65  9168.95  585.87
2016-08-30  2874.91  3030.75  344.75  326.79  410.42  352.21  9191.19  586.47
2016-08-31  2862.91  3023.13  343.53  325.76  409.06  350.85  9164.74  583.97
2016-09-01  2854.25  3017.49  343.66  325.76  408.09  351.09  9129.94  581.72
2016-09-02  2922.57  3079.74  350.44  331.68  415.29  358.51  9242.88  588.47
2016-09-05  2920.66  3077.66  350.62  331.75  415.97  358.79  9283.79  591.37
2016-09-06  2907.22  3070.16  349.46  330.83  414.90  357.44  9244.89  589.16
2016-09-07  2913.59  3091.66  350.46  332.94  417.40  357.32  9316.41  592.98
2016-09-08  2903.80  3083.54  349.32  331.90  415.99  356.13  9294.86  590.84
2016-09-09  2876.75  3053.20  345.52  328.27  411.44  352.26  9177.09  582.15
2016-09-12  2852.97  3012.88  342.23  324.26  407.32  349.77  9110.18  578.20
2016-09-13  2818.84  2974.80  338.72  321.20  404.20  345.92  9061.31  576.05
2016-09-14  2813.91  2964.90  338.42  320.42  403.59  346.11  9058.81  577.25
2016-09-15  2829.93  2973.77  340.34  321.59  405.12  348.69  9092.44  579.92
2016-09-16  2807.99  2935.25  337.82  318.22  401.51  347.09  9018.62  576.97
2016-09-19  2836.53  2968.31  341.27  321.75  405.45  350.36  9114.92  582.94
2016-09-20  2834.76  2964.86  341.00  321.55  405.79  350.02  9100.36  582.42
2016-09-21  2848.58  2982.18  342.46  323.28  407.60  351.18  9126.98  583.70
2016-09-22  2891.55  3051.69  347.86  329.87  414.72  355.27  9255.44  591.88
2016-09-23  2869.70  3032.31  345.34  327.95  412.15  352.23  9176.11  587.07
2016-09-26  2825.06  2975.88  340.00  322.53  405.88  347.13  9064.10  580.28
2016-09-27  2830.24  2970.84  340.19  321.86  405.15  348.15  9010.63  577.18
2016-09-28  2846.55  2991.11  342.57  324.24  407.97  350.45  9072.09  581.27
2016-09-29  2848.93  2991.58  342.72  324.08  407.65  350.90  9112.09  582.60
2016-09-30  2843.17  3002.24  342.92  325.31  408.27  350.09  9115.81  583.26
2016-10-03  2845.43  2998.50  343.23  325.08  408.44  350.92  9131.24  584.32
2016-10-04  2871.06  3029.50  346.10  327.73  411.41  353.92  9212.05  588.71

[7673 rows x 8 columns]

In [24]:
returns = stoxxeu600.pct_change()
returns

,SX5P,SX5E,SXXP,SXXE,SXXF,SXXA,DK5F,DKXF
Date,,,,,,,,
1986-12-31,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1987-01-01,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
1987-01-02,-0.005303,-0.010035,-0.002296,-0.007912,-0.006425,0.004489,0.003657,0.003813
1987-01-05,0.001297,0.007345,0.003028,0.008180,0.007800,-0.003027,0.003582,0.000152
1987-01-06,0.005221,0.004442,0.005554,0.005984,0.006518,0.004916,0.003923,0.003646
1987-01-07,0.006818,-0.003513,0.006004,-0.002319,-0.002125,0.015683,-0.000797,0.002119
1987-01-08,-0.004595,-0.013101,-0.003103,-0.011015,-0.009532,0.005950,-0.009816,-0.008761
1987-01-09,-0.010056,-0.021479,-0.005867,-0.015940,-0.014947,0.005492,-0.011680,-0.007315
1987-01-12,0.006846,0.012783,0.007347,0.012771,0.009977,0.001401,-0.006097,-0.001689
1987-01-13,-0.006541,-0.007585,-0.007652,-0.007792,-0.008232,-0.007413,-0.018450,-0.017838
1987-01-14,0.002649,0.004182,-0.000120,0.003720,0.002179,-0.004368,-0.030220,-0.022076
1987-01-15,0.009171,0.009106,0.009399,0.009883,0.010457,0.008774,0.027136,0.022895
1987-01-16,0.003260,-0.000667,0.004536,0.000102,0.000615,0.009400,0.006064,0.011895
1987-01-19,-0.010529,-0.008633,-0.009031,-0.007950,-0.007577,-0.010146,0.010901,0.009281
1987-01-20,0.000078,-0.001198,0.001319,-0.001952,-0.000929,0.005055,0.011196,0.007969
1987-01-21,-0.003103,-0.003005,-0.001796,-0.001235,-0.000929,-0.002515,0.002745,0.004409
1987-01-22,0.002996,0.004837,0.001560,0.004329,0.002171,-0.001401,-0.018659,-0.015743
1987-01-23,0.006284,0.007905,0.007667,0.008621,0.007427,0.006452,0.001658,-0.001077
1987-01-26,-0.011410,-0.014327,-0.008797,-0.012821,-0.011467,-0.004320,-0.006253,-0.003849
1987-01-27,0.003613,-0.003180,0.003118,-0.002577,-0.003107,0.009377,-0.016508,-0.015920
1987-01-28,-0.026588,-0.034082,-0.021162,-0.029348,-0.028468,-0.012202,-0.016475,-0.012722
1987-01-29,0.007317,0.010470,0.005374,0.009582,0.010159,0.000983,0.014798,0.012727
1987-01-30,0.012455,0.013807,0.010813,0.012654,0.011645,0.008835,0.021172,0.016651
1987-02-02,-0.003457,-0.011699,-0.002043,-0.009268,-0.007953,0.005838,0.009248,0.007417
1987-02-03,-0.009595,-0.011107,-0.008672,-0.011457,-0.010127,-0.005804,0.020970,0.016871
1987-02-04,0.007613,-0.001274,0.004981,-0.001808,-0.002131,0.012232,-0.001969,0.000000
1987-02-05,0.001653,-0.006559,0.002055,-0.007137,-0.006941,0.011673,0.009785,0.007994
1987-02-06,0.015296,0.011044,0.011823,0.008261,0.007420,0.015339,-0.007875,-0.007033
1987-02-09,0.001793,0.002968,0.001908,0.004256,0.003950,-0.000401,-0.016496,-0.015973
1987-02-10,-0.015399,-0.008074,-0.013329,-0.007523,-0.008293,-0.019259,-0.005029,-0.005207
...,...,...,...,...,...,...,...,...
2016-08-24,0.004167,0.004964,0.003871,0.003205,0.002497,0.004457,0.005542,0.003831
2016-08-25,-0.007776,-0.006947,-0.008436,-0.006851,-0.007448,-0.009836,-0.007181,-0.006526
2016-08-26,0.005289,0.007588,0.004970,0.006558,0.005486,0.003540,0.005460,0.004922
2016-08-29,-0.001084,-0.003940,-0.001513,-0.003503,-0.002251,0.000284,-0.000656,-0.000085
2016-08-30,0.006131,0.010755,0.004516,0.007771,0.006474,0.001592,0.002426,0.001024
2016-08-31,-0.004174,-0.002514,-0.003539,-0.003152,-0.003314,-0.003861,-0.002878,-0.004263
2016-09-01,-0.003025,-0.001866,0.000378,0.000000,-0.002371,0.000684,-0.003797,-0.003853
2016-09-02,0.023936,0.020630,0.019729,0.018173,0.017643,0.021134,0.012370,0.011604
2016-09-05,-0.000654,-0.000675,0.000514,0.000211,0.001637,0.000781,0.004426,0.004928
2016-09-06,-0.004602,-0.002437,-0.003308,-0.002773,-0.002572,-0.003763,-0.004190,-0.003737
2016-09-07,0.002191,0.007003,0.002862,0.006378,0.006026,-0.000336,0.007736,0.006484
2016-09-08,-0.003360,-0.002626,-0.003253,-0.003124,-0.003378,-0.003330,-0.002313,-0.003609
2016-09-09,-0.009315,-0.009839,-0.010878,-0.010937,-0.010938,-0.010867,-0.012670,-0.014708
2016-09-12,-0.008266,-0.013206,-0.009522,-0.012216,-0.010014,-0.007069,-0.007291,-0.006785
2016-09-13,-0.011963,-0.012639,-0.010256,-0.009437,-0.007660,-0.011007,-0.005364,-0.003718
2016-09-14,-0.001749,-0.003328,-0.000886,-0.002428,-0.001509,0.000549,-0.000276,0.002083
2016-09-15,0.005693,0.002992,0.005673,0.003651,0.003791,0.007454,0.003712,0.004625
2016-09-16,-0.007753,-0.012953,-0.007404,-0.010479,-0.008911,-0.004589,-0.008119,-0.005087
2016-09-19,0.010164,0.011263,0.010213,0.011093,0.009813,0.009421,0.010678,0.010347
2016-09-20,-0.000624,-0.001162,-0.000791,-0.000622,0.000839,-0.000970,-0.001597,-0.000892
2016-09-21,0.004875,0.005842,0.004282,0.005380,0.004460,0.003314,0.002925,0.002198
2016-09-22,0.015085,0.023308,0.015768,0.020385,0.017468,0.011646,0.014075,0.014014
2016-09-23,-0.007557,-0.006351,-0.007244,-0.005820,-0.006197,-0.008557,-0.008571,-0.008127
2016-09-26,-0.015556,-0.018610,-0.015463,-0.016527,-0.015213,-0.014479,-0.012207,-0.011566
2016-09-27,0.001834,-0.001694,0.000559,-0.002077,-0.001799,0.002938,-0.005899,-0.005342
2016-09-28,0.005763,0.006823,0.006996,0.007395,0.006960,0.006606,0.006821,0.007086
2016-09-29,0.000836,0.000157,0.000438,-0.000493,-0.000784,0.001284,0.004409,0.002288
2016-09-30,-0.002022,0.003563,0.000584,0.003795,0.001521,-0.002308,0.000408,0.001133
2016-10-03,0.000795,-0.001246,0.000904,-0.000707,0.000416,0.002371,0.001693,0.001817
2016-10-04,0.009007,0.010339,0.008362,0.008152,0.007272,0.008549,0.008850,0.007513

In [23]:
returns.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 7673 entries, 1986-12-31 to 2016-10-04
Data columns (total 8 columns):
SX5P    7671 non-null float64
SX5E    7671 non-null float64
SXXP    7671 non-null float64
SXXE    7671 non-null float64
SXXF    7671 non-null float64
SXXA    7671 non-null float64
DK5F    7671 non-null float64
DKXF    7671 non-null float64
dtypes: float64(8)
memory usage: 539.5 KB

In [25]:
returns.head()

,SX5P,SX5E,SXXP,SXXE,SXXF,SXXA,DK5F,DKXF
Date,,,,,,,,
1986-12-31,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1987-01-01,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
1987-01-02,-0.005303,-0.010035,-0.002296,-0.007912,-0.006425,0.004489,0.003657,0.003813
1987-01-05,0.001297,0.007345,0.003028,0.008180,0.007800,-0.003027,0.003582,0.000152
1987-01-06,0.005221,0.004442,0.005554,0.005984,0.006518,0.004916,0.003923,0.003646

In [26]:
returns[['SX5P','SX5E']].corr()

          SX5P      SX5E
SX5P  1.000000  0.971184
SX5E  0.971184  1.000000

In [27]:
returns.corr()

,SX5P,SX5E,SXXP,SXXE,SXXF,SXXA,DK5F,DKXF
SX5P,1.000000,0.971184,0.991923,0.971269,0.976083,0.972517,0.891755,0.884861
SX5E,0.971184,1.000000,0.971100,0.994512,0.988025,0.909379,0.889065,0.883671
SXXP,0.991923,0.971100,1.000000,0.979871,0.985004,0.979860,0.910149,0.899806
SXXE,0.971269,0.994512,0.979871,1.000000,0.995948,0.920890,0.904053,0.897481
SXXF,0.976083,0.988025,0.985004,0.995948,1.000000,0.934809,0.919704,0.911232
SXXA,0.972517,0.909379,0.979860,0.920890,0.934809,1.000000,0.879582,0.865911
DK5F,0.891755,0.889065,0.910149,0.904053,0.919704,0.879582,1.000000,0.981443
DKXF,0.884861,0.883671,0.899806,0.897481,0.911232,0.865911,0.981443,1.000000

In [28]:
returns[['SX5P','SX5E']].cov()

          SX5P      SX5E
SX5P  0.000276  0.000284
SX5E  0.000284  0.000309

In [29]:
returns.cov()

,SX5P,SX5E,SXXP,SXXE,SXXF,SXXA,DK5F,DKXF
SX5P,0.000276,0.000284,0.000264,0.000270,0.000264,0.000259,0.000266,0.000272
SX5E,0.000284,0.000309,0.000274,0.000293,0.000282,0.000256,0.000280,0.000287
SXXP,0.000264,0.000274,0.000257,0.000263,0.000257,0.000252,0.000262,0.000266
SXXE,0.000270,0.000293,0.000263,0.000281,0.000271,0.000247,0.000272,0.000278
SXXF,0.000264,0.000282,0.000257,0.000271,0.000265,0.000243,0.000269,0.000274
SXXA,0.000259,0.000256,0.000252,0.000247,0.000243,0.000256,0.000253,0.000256
DK5F,0.000266,0.000280,0.000262,0.000272,0.000269,0.000253,0.000322,0.000325
DKXF,0.000272,0.000287,0.000266,0.000278,0.000274,0.000256,0.000325,0.000341

*Summarizing and Computing Descriptive Statistics* >
### Unique Values, Value Counts, and Membership

**<code>unique</code>** gives you an array of the unique values in a <code>Series</code>:

In [30]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [31]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [32]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [33]:
pd.value_counts(obj.values, sort=False)

d    1
b    2
c    3
a    3
dtype: int64

**<code>isin</code>** is responsible for vectorized set membership and can be very useful in filtering a data set down to a subset of values in a <code>Series</code> or column in a <code>DataFrame</code>:

In [34]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [35]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

![](Pics/picture_3_11.png)

We may want to compute a histogram on multiple related columns in a <code>DataFrame</code>.

In [36]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4], 
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 6, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    6
2    4    1    2
3    3    2    4
4    4    3    4

In [37]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
6  0.0  0.0  1.0

*Handling Missing Data* >
## Handling Missing Data

One of the goals in designing <code>pandas</code> was to make working with missing data as painless as possible. All of the descriptive statistics on <code>pandas</code> objects exclude missing data.

<code>pandas</code> uses the floating point value NaN (Not a Number) to represent missing data in both floating as well as in non-floating point arrays. It is just used as a sentinel that can be easily detected.

In [38]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [39]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

The built-in <code>Python</code> <code>None</code> value is also treated as <code>NA</code> in object arrays:

In [40]:
string_data[0] = None

In [41]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

![](Pics/picture_3_12.png)

*Handling Missing Data* >
### Filtering Out Missing Data

In [42]:
from numpy import nan as NA

In [43]:
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [44]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

Drop rows or columns which are all <code>NA</code> or just those containing any <code>NA</code>s. **<code>dropna</code>** by default drops any row containing a missing value:

In [45]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [46]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

Passing **<code>how='all'<code>** will only drop rows that are all <code>NA</code>:

In [47]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

Dropping columns in the same way is only a matter of passing <code>axis=1</code>:

In [48]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [49]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

If we want to keep only rows containing a certain number of observations. We can indicate this with the thresh argument:

In [50]:
df = DataFrame(np.random.randn(7, 3))

In [51]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

/Users/yoonjoonlee/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
0 -1.905490       NaN       NaN
1  1.917998       NaN       NaN
2  0.244204       NaN       NaN
3  0.061459       NaN -1.665444
4 -0.383005       NaN -0.473165
5 -0.436887  1.897935  0.952357
6 -1.364738 -0.558367  0.220185

In [52]:
df.dropna(thresh = 3)

          0         1         2
5 -0.436887  1.897935  0.952357
6 -1.364738 -0.558367  0.220185

In [53]:
df.dropna(thresh = 2)

          0         1         2
3  0.061459       NaN -1.665444
4 -0.383005       NaN -0.473165
5 -0.436887  1.897935  0.952357
6 -1.364738 -0.558367  0.220185

*Handling Missing Data* >
### Filling in Missing Data

Fill in the “holes” in any number of ways

In [54]:
df.fillna(0)

          0         1         2
0 -1.905490  0.000000  0.000000
1  1.917998  0.000000  0.000000
2  0.244204  0.000000  0.000000
3  0.061459  0.000000 -1.665444
4 -0.383005  0.000000 -0.473165
5 -0.436887  1.897935  0.952357
6 -1.364738 -0.558367  0.220185

In [55]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -1.905490  0.500000       NaN
1  1.917998  0.500000       NaN
2  0.244204  0.500000       NaN
3  0.061459  0.500000 -1.665444
4 -0.383005  0.500000 -0.473165
5 -0.436887  1.897935  0.952357
6 -1.364738 -0.558367  0.220185

**<code>fillna</code>** returns a new object, but you can modify the existing object in place:

In [56]:
_  = df.fillna(0, inplace=True)
df

          0         1         2
0 -1.905490  0.000000  0.000000
1  1.917998  0.000000  0.000000
2  0.244204  0.000000  0.000000
3  0.061459  0.000000 -1.665444
4 -0.383005  0.000000 -0.473165
5 -0.436887  1.897935  0.952357
6 -1.364738 -0.558367  0.220185

In [57]:
df.fillna(0, inplace = True)
df

          0         1         2
0 -1.905490  0.000000  0.000000
1  1.917998  0.000000  0.000000
2  0.244204  0.000000  0.000000
3  0.061459  0.000000 -1.665444
4 -0.383005  0.000000 -0.473165
5 -0.436887  1.897935  0.952357
6 -1.364738 -0.558367  0.220185

The same interpolation methods available for reindexing can be used with fillna:

In [58]:
df = DataFrame(np.random.randn(6, 3))

In [59]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

/Users/yoonjoonlee/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [60]:
df

          0         1         2
0 -0.587709  0.614293  0.379140
1 -0.437709 -1.217148  0.459684
2  0.025520       NaN -0.841837
3  0.825345       NaN  0.735692
4  1.009883       NaN       NaN
5  1.114319       NaN       NaN

In [61]:
df.fillna(method='ffill')

          0         1         2
0 -0.587709  0.614293  0.379140
1 -0.437709 -1.217148  0.459684
2  0.025520 -1.217148 -0.841837
3  0.825345 -1.217148  0.735692
4  1.009883 -1.217148  0.735692
5  1.114319 -1.217148  0.735692

In [62]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.587709  0.614293  0.379140
1 -0.437709 -1.217148  0.459684
2  0.025520 -1.217148 -0.841837
3  0.825345 -1.217148  0.735692
4  1.009883       NaN  0.735692
5  1.114319       NaN  0.735692

![](Pics/picture_3_13.png)

*Hierarchical Indexing* >
## Hierarchical Indexing

*Hierarchical indexing* is an important feature of <code>pandas</code> enabling us to have multiple (two or more) index levels on an axis. Somewhat abstractly, it provides a way for you to work with higher dimensional data in a lower dimensional form.

In [63]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    2.040400
   2   -0.588897
   3    0.332020
b  1    1.122791
   2    0.444450
   3   -0.486315
c  1    0.363171
   2   -0.638379
d  2   -0.141286
   3   -0.932114
dtype: float64

In [64]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

With a hierarchically-indexed object, so-called partial indexing is possible, enabling us to concisely select subsets of the data:

In [65]:
data['b']

1    1.122791
2    0.444450
3   -0.486315
dtype: float64

In [66]:
data['b':'c']

b  1    1.122791
   2    0.444450
   3   -0.486315
c  1    0.363171
   2   -0.638379
dtype: float64

In [67]:
data.ix[['b', 'd']]

/Users/yoonjoonlee/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1    1.122791
   2    0.444450
   3   -0.486315
d  2   -0.141286
   3   -0.932114
dtype: float64

Selection is even possible in some cases from an “inner” level:

In [68]:
data[:-2]

a  1    2.040400
   2   -0.588897
   3    0.332020
b  1    1.122791
   2    0.444450
   3   -0.486315
c  1    0.363171
   2   -0.638379
dtype: float64

Hierarchical indexing plays a critical role in reshaping data and group-based operations like forming a pivot table.

In [72]:
data.unstack()

          1         2         3
a  2.040400 -0.588897  0.332020
b  1.122791  0.444450 -0.486315
c  0.363171 -0.638379       NaN
d       NaN -0.141286 -0.932114

The inverse operation of <code>unstack</code> is <code>stack</code>:

In [70]:
data.unstack().stack()

a  1    2.040400
   2   -0.588897
   3    0.332020
b  1    1.122791
   2    0.444450
   3   -0.486315
c  1    0.363171
   2   -0.638379
d  2   -0.141286
   3   -0.932114
dtype: float64

Either <code>axis</code> can have a hierarchical <code>index</code>

In [73]:
frame = DataFrame(np.arange(12).reshape((4, 3)), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [74]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['states', 'color']
frame

states     Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [75]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

*Hierarchical Indexing* >
### Reordering and Sorting Levels

At times we will need to rearrange the order of the levels on an <code>axis</code> or sort the data by the values in one specific level. The <code>swaplevel</code> takes two level numbers or names and returns a new object with the levels interchanged:

In [76]:
frame.swaplevel('key1', 'key2')

states     Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

**<code>sortlevel</code>** sorts the data (stably) using only the values in a single level.

In [77]:
frame.sortlevel(1)

/Users/yoonjoonlee/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

states     Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [78]:
frame.swaplevel(0, 1).sortlevel(0)

/Users/yoonjoonlee/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

states     Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

*Hierarchical Indexing* >
### Summary Statistics by Level

Many descriptive and summary statistics on <code>DataFrame</code> and <code>Series</code> have a level option in which we can specify the level you want to sum by on a particular axis.

In [79]:
frame.sum(level='key2')

states  Ohio     Colorado
color  Green Red    Green
key2
1          6   8       10
2         12  14       16

In [80]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

*Hierarchical Indexing* >
### Using a <code>DataFrame</code>’s Columns

It’s not unusual to want to use one or more columns from a <code>DataFrame</code> as the row index; alternatively, we may wish to move the row index into the <code>DataFrame</code>’s columns.

In [81]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

<code>DataFrame</code>’s <code>set_index</code> function will create a new <code>DataFrame</code> using one or more of its columns as the index:

In [82]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

By default the columns are removed from the <code>DataFrame</code>, though we can leave them in:

In [83]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

**<code>reset_index</code>** does the opposite of <code>set_index</code>;

In [84]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

*Other pandas Topics* >
## Other pandas Topics

*Other pandas Topics* >
### Integer Indexing

Working with <code>pandas</code> objects indexed by integers is something that often trips up new users due to some differences with indexing semantics on built-in <code>Python</code> data
structures like <code>lists</code> and <code>tuples</code>.

In [ ]:
ser = Series(np.arange(3.))
ser[-1]

In [ ]:
ser

In [ ]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])

In [ ]:
ser2[-1]

In [ ]:
ser.ix[:1]

In [ ]:
ser3 = Series(range(3), index=[-5, 1, 3])

In [ ]:
ser3.iget_value(2)

In [ ]:
ser3.iloc[2]

In [ ]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2, 0, 1])
frame

In [ ]:
frame.irow(0)

In [ ]:
frame.iloc[0]

*Other pandas Topics* >
### Panel Data

<code>pandas</code> has a <code>Panel</code> data structure, which you can think of as a three-dimensional analogue of <code>DataFrame</code>.

Select the data from the panel using 
- Items
- Major_axis
- Minor_axis

In [85]:
# creating an empty panel
import pandas as pd
import numpy as np
data = {'Item1' : pd.DataFrame(np.random.randn(4, 3)), 
        'Item2' : pd.DataFrame(np.random.randn(4, 2))}
p = pd.Panel(data)
p['Item1']

          0         1         2
0 -0.140447  0.603973  0.359966
1 -0.478240 -0.351213  1.717489
2 -0.177706 -0.428341  0.307169
3 -1.296313 -0.899009 -0.110574

In [89]:
p['Item1'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
0    4 non-null float64
1    4 non-null float64
2    4 non-null float64
dtypes: float64(3)
memory usage: 176.0 bytes

In [91]:
p.info()

AttributeError: 'Panel' object has no attribute 'info'

In [92]:
p.major_xs(1)

      Item1     Item2
0 -0.478240 -0.098659
1 -0.351213  0.507991
2  1.717489       NaN

In [93]:
p.minor_xs(1)

      Item1     Item2
0  0.603973  1.728959
1 -0.351213  0.507991
2 -0.428341  0.282156
3 -0.899009  0.557442